#+TITLE: Functional programming
#+date: <2025-05-10 Sat>
#+AUTHOR: Nicky

#+OPTIONS: toc:nil author:t date:t title:t

#+LATEX_CLASS: subfiles
#+LATEX_CLASS_OPTIONS: [sicm_sagemath]

#+PROPERTY: header-args:sage :session functional :eval never-export :exports code :results none :tangle ../sage/functions_tests.sage :dir ../sage/



** Examples


#+attr_latex: :options label=../sage/functions\_tests.sage
#+begin_src sage :exports both :results replace latex
x, y = var("x y", domain = RR)

show((square)(x + y).expand())
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
x^{2} + 2 \, x y + y^{2}
\end{dmath*}
#+end_export

#+attr_latex: :options label=../sage/functions\_tests.sage
#+begin_src sage :exports both :results replace latex
show((square + square)(x + y))
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
2 \, {\left(x + y\right)}^{2}
\end{dmath*}
#+end_export

#+attr_latex: :options label=../sage/functions\_tests.sage
#+begin_src sage :exports both :results replace latex
show((square * square)(x))
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
x^{4}
\end{dmath*}
#+end_export

#+attr_latex: :options label=../sage/functions\_tests.sage
#+begin_src sage :exports both :results replace latex
show((sin + cos)(x))
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
\cos\left(x\right) + \sin\left(x\right)
\end{dmath*}
#+end_export

#+attr_latex: :options label=../sage/functions\_tests.sage
#+begin_src sage :exports both :results replace latex
show((square + V)(x))
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
x^{2} + V\left(x\right)
\end{dmath*}
#+end_export

#+attr_latex: :options label=../sage/functions\_tests.sage
#+begin_src sage :exports both :results replace latex
hh = compose(square, sin)
show((hh + hh)(x))
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
2 \, \sin\left(x\right)^{2}
\end{dmath*}
#+end_export

We know that $2 \sin x \cos x = \sin(2 x)$.

#+attr_latex: :options label=../sage/functions\_tests.sage
#+begin_src sage :exports both :results replace latex
show((2 * (sin * cos)(x) - sin(2 * x)).simplify_full())
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
0
\end{dmath*}
#+end_export

Next, we test differentiation and  integration.
#+attr_latex: :options label=../sage/functions\_tests.sage
#+begin_src sage :exports both :results replace latex
show(diff(-compose(square, cos)(x), x))
show(integrate((2 * sin * cos)(x), x))
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
2 \, \cos\left(x\right) \sin\left(x\right)
\end{dmath*}
\begin{dmath*}
-\cos\left(x\right)^{2}
\end{dmath*}
#+end_export

Arithmetic with symbolic functions works too.

#+attr_latex: :options label=../sage/functions\_tests.sage
#+begin_src sage
U = Function(lambda x: function("U")(x))
V = Function(lambda x: function("V")(x))
#+end_src

#+attr_latex: :options label=../sage/functions\_tests.sage
#+begin_src sage :exports both :results replace latex
show((U + V)(x))
show((V + V)(x))
show((V(U(x))))
show((compose(V, U)(x)))
#+end_src


#+RESULTS:
#+begin_export latex
\begin{dmath*}
U\left(x\right) + V\left(x\right)
\end{dmath*}
\begin{dmath*}
2 \, V\left(x\right)
\end{dmath*}
\begin{dmath*}
V\left(U\left(x\right)\right)
\end{dmath*}
\begin{dmath*}
V\left(U\left(x\right)\right)
\end{dmath*}
#+end_export


#+attr_latex: :options label=../sage/functions\_tests.sage
#+begin_src sage
def f(x):
    def g(y):
        return x * y ^ 2

    return g
#+end_src

#+attr_latex: :options label=../sage/functions\_tests.sage
#+begin_src sage :exports both :results replace latex
show(f(3)(5))
#+end_src


#+RESULTS:
#+begin_export latex
\begin{dmath*}
75
\end{dmath*}
#+end_export

However, we cannot apply algebraic operations on  ~f~. For instance, this does not work; it gives TypeError: unsupported operand type(s) for +: 'function' and 'function'.
#+attr_latex: :options label=don't tangle
#+begin_src sage :tangle no
show((f(3) + f(2))(4))
#+end_src

By decoration with ~@Func~ we get what we need.
#+attr_latex: :options label=../sage/functions\_tests.sage
#+begin_src sage
@Func
def f(x):
    def g(y):
        return x * y ^ 2

    return g
#+end_src

#+attr_latex: :options label=../sage/functions\_tests.sage
#+begin_src sage :exports both :results replace latex
show((f(3) + f(2))(4))
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
80
\end{dmath*}
#+end_export


Indeed: $(3+2)*4^2 = 80$.

Decorating with ~@Func~ is the same as this.
#+attr_latex: :options label=../sage/functions\_tests.sage
#+begin_src sage
def f(x):
    def g(y):
        return x * y ^ 2

    return Function(lambda y: g(y))
#+end_src

#+attr_latex: :options label=../sage/functions\_tests.sage
#+begin_src sage :exports both :results replace latex
show((f(3) + f(2))(4))
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
80
\end{dmath*}
#+end_export
